# OriginalColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorSelectionDialog..::..OriginalColor Property
ColorSelectionDialog Class See Also
---
The original color.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public Color OriginalColor { get; set; }
```

Visual Basic
---
```text
Public Property OriginalColor As Color
	Get
	Set
```

Visual C++
---
```text
public:
property Color^ OriginalColor {
	Color^ get ();
	void set (Color^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace